{"meals":[{"idMeal":"52918","strMeal":"Fish Stew with Rouille","strDrinkAlternate":null,"strCategory":"Seafood","strArea":"French","strInstructions":"Twist the heads from the prawns, then peel away the legs and shells, but leave the tails intact. Devein each prawn. Fry the shells in 1 tbsp oil for 5 mins, until dark pink and golden in patches. Add the wine, boil down by two thirds, then pour in the stock. Strain into a jug, discarding the shells.\r\nHeat the rest of the oil in a deep frying pan or casserole. Add the fennel, onion and garlic, season, then cover and gently cook for 10 mins until softened. Meanwhile, peel the potato and cut into 2cm-ish chunks. Put into a pan of cold water, bring to the boil and cook for 5 mins until almost tender. Drain in a colander.\r\nPeel a strip of zest from the orange. Put the zest, star anise, bay and ½ tsp harissa into the pan. Fry gently, uncovered, for 5-10 mins, until the vegetables are soft, sweet and golden.\r\nStir in the tomato purée, cook for 2 mins, then add the tomatoes and stock. Simmer for 10 mins until the sauce thickens slightly. Season to taste. The sauce can be made ahead, then reheated later in the day. Meantime, scrub the mussels or clams and pull away any stringy beards. Any that are open should be tapped sharply on the worktop – if they don’t close after a few seconds, discard them.\r\nReheat the sauce if necessary, then stir the potato, chunks of fish and prawns very gently into the stew. Bring back to the boil, then cover and gently simmer for 3 mins. Scatter the mussels or clams over the stew, then cover and cook for 2 mins more or until the shells have opened wide. Discard any that remain closed. The chunks of fish should flake easily and the prawns should be pink through. Scatter with the thyme leaves.\r\nTo make the quick rouille, stir the rest of the harissa through the mayonnaise. Serve the stew in bowls, topped with spoonfuls of rouille, which will melt into the sauce and enrich it. Have some good bread ready, as you’ll definitely want to mop up the juices.","strMealThumb":"https:\/\/www.themealdb.com\/images\/media\/meals\/vptqpw1511798500.jpg","strTags":"Fish,Seafood,Shellfish","strYoutube":"https:\/\/www.youtube.com\/watch?v=fp9Lqx2EUco","strIngredient1":"Prawns","strIngredient2":"Olive Oil","strIngredient3":"Dry White Wine","strIngredient4":"Fish Stock","strIngredient5":"Fennel","strIngredient6":"Onion","strIngredient7":"Garlic","strIngredient8":"Potatoes","strIngredient9":"Orange","strIngredient10":"Star Anise","strIngredient11":"Bay Leaf","strIngredient12":"Harissa Spice","strIngredient13":"Tomato Puree","strIngredient14":"Chopped Tomatoes","strIngredient15":"Mussels","strIngredient16":"White Fish","strIngredient17":"Thyme","strIngredient18":"Bread","strIngredient19":"","strIngredient20":"","strMeasure1":"6 large","strMeasure2":"3 tbs","strMeasure3":"150ml","strMeasure4":"200ml","strMeasure5":"1 small finely diced","strMeasure6":"1 small finely diced","strMeasure7":"3 cloves Chopped","strMeasure8":"1 large","strMeasure9":"1","strMeasure10":"1","strMeasure11":"1","strMeasure12":"1 1\/2 tsp ","strMeasure13":"2 tbs","strMeasure14":"400g","strMeasure15":"Handful","strMeasure16":"200g","strMeasure17":"2","strMeasure18":"to serve","strMeasure19":"","strMeasure20":"","strSource":"https:\/\/www.bbcgoodfood.com\/recipes\/532640\/summer-fish-stew-with-rouille","dateModified":null}]}